--Database access configuration for the manager and cashier roles
--Requirements:
-- Менеджер:
-- 1. Додавати нові дані про працівників, постійних клієнтів, категорії товарів, товари,
-- товари у магазині;
-- 2. Редагувати дані про працівників, постійних клієнтів, категорії товарів, товари,
-- товари у магазині;
-- 3. Видаляти дані про працівників, постійних клієнтів, категорії товарів, товари,
-- товари у магазині, чеки;
-- 4. Видруковувати звіти з інформацією про усіх працівників, постійних клієнтів,
-- категорії товарів, товари, товари у магазині, чеки;
-- 5. Отримати інформацію про усіх працівників, відсортованих за прізвищем;
-- 6. Отримати інформацію про усіх працівників, що займають посаду касира,
-- відсортованих за прізвищем;
-- 7. Отримати інформацію про усіх постійних клієнтів, відсортованих за прізвищем;
-- 8. Отримати інформацію про усі категорії, відсортовані за назвою;
-- 9. Отримати інформацію про усі товари, відсортовані за назвою;
-- 10. Отримати інформацію про усі товари у магазині, відсортовані за кількістю;
-- 11. За прізвищем працівника знайти його телефон та адресу;
-- 12. Отримати інформацію про усіх постійних клієнтів, що мають карту клієнта із
-- певним відсотком, посортованих за прізвищем;
-- 13. Здійснити пошук усіх товарів, що належать певній категорії, відсортованих за
-- назвою;
-- 14. За UPC-товару знайти ціну продажу товару, кількість наявних одиниць товару,
-- назву та характеристики товару;
-- 15. Отримати інформацію про усі акційні товари, відсортовані за кількістю одиниць
-- товару/ за назвою;
-- 16. Отримати інформацію про усі не акційні товари, відсортовані за кількістю
-- одиниць товару/ за назвою;
GRANT SELECT, INSERT, UPDATE, DELETE ON Employee TO manager_role;
GRANT SELECT, INSERT, UPDATE, DELETE ON Customer_Card TO manager_role;
GRANT SELECT, INSERT, UPDATE, DELETE ON Category TO manager_role;
GRANT SELECT, INSERT, UPDATE, DELETE ON Product TO manager_role;
GRANT SELECT, INSERT, UPDATE, DELETE ON Store_Product TO manager_role;
-- 17. Отримати інформацію про усі чеки, створені певним касиром за певний період
-- часу (з можливістю перегляду куплених товарів у цьому чеку, їх назви, к-сті та ціни);
-- 18. Отримати інформацію про усі чеки, створені усіма касирами за певний період
-- часу (з можливістю перегляду куплених товарів у цьому чеку, їх назва, к-сті та ціни);
-- 19. Визначити загальну суму проданих товарів з чеків, створених певним касиром за
-- певний період часу;
-- 20. Визначити загальну суму проданих товарів з чеків, створених усіма касиром за
-- певний період часу;
-- 21. Визначити загальну кількість одиниць певного товару, проданого за певний
-- період часу.
GRANT SELECT, DELETE ON "Check" TO manager_role;
REVOKE INSERT, UPDATE ON "Check" FROM manager_role;
GRANT SELECT ON Sale TO manager_role;

-- Касир:
-- 1. Отримати інформацію про усі товари, відсортовані за назвою;
-- 4. Здійснити пошук товарів за назвою;
-- 5. Здійснити пошук товарів, що належать певній категорії, відсортованих за назвою;
GRANT SELECT ON Product TO cashier_role;
-- 3. Отримати інформацію про усіх постійних клієнтів, відсортованих за прізвищем;
-- 6. Здійснити пошук постійних клієнтів за прізвищем;
-- 8. Додавати/редагувати інформацію про постійних клієнтів;
GRANT SELECT, INSERT, UPDATE ON Customer_Card TO cashier_role;
-- 7. Здійснювати продаж товарів (додавання чеків);
-- 9. Переглянути список усіх чеків, що створив касир за цей день;
-- 10. Переглянути список усіх чеків, що створив касир за певний період часу;
-- 11. За номером чеку вивести усю інформацію про даний чек, в тому числі
-- інформацію про назву, к-сть та ціну товарів, придбаних в даному чеку.
GRANT SELECT, INSERT ON "Check" TO cashier_role;
GRANT SELECT ON Sale TO cashier_role;
-- 2. Отримати інформацію про усі товари у магазині, відсортовані за назвою;
-- 12. Отримати інформацію про усі акційні товари, відсортовані за кількістю одиниць
-- товару/ за назвою;
-- 13. Отримати інформацію про усі не акційні товарів, відсортовані за кількістю
-- одиниць товару/ за назвою;
-- 14. За UPC-товару знайти ціну продажу товару, кількість наявних одиниць товару.
GRANT SELECT ON Store_Product TO cashier_role;
-- 15. Можливість отримати усю інформацію про себе.
CREATE VIEW my_employee_info AS
SELECT *
FROM Employee
WHERE id_employee = current_setting('my.employee_id');

GRANT SELECT ON my_employee_info TO cashier_role;
REVOKE ALL ON Employee FROM cashier_role;